In [2]:
import pandas as pd
df = pd.read_csv(r'C:\Users\rajat.prakash\Desktop\Remote_repo\Data\Data_Analysis\Files\Uber Drives 2016.csv')
df.columns

Index([&#39;START_DATE*&#39;, &#39;END_DATE*&#39;, &#39;CATEGORY*&#39;, &#39;START*&#39;, &#39;STOP*&#39;, &#39;MILES*&#39;,
       &#39;PURPOSE*&#39;],
      dtype=&#39;object&#39;)

In [18]:
test = df.loc[df['STOP*'] == 'New York',['START_DATE*','END_DATE*']]
test

         START_DATE*        END_DATE*
9    1/10/2016 12:17  1/10/2016 12:44
11   1/10/2016 18:18  1/10/2016 18:53
104  2/14/2016 14:07  2/14/2016 14:40
416   6/8/2016 12:04   6/8/2016 13:01

In [23]:
second = df[df['START_DATE*'] > str(2/14/2016)]
second

         START_DATE*        END_DATE*  ... MILES* PURPOSE*
500    7/1/2016 0:00    7/1/2016 0:25  ...    9.9  Meeting
501    7/1/2016 9:34    7/1/2016 9:57  ...   13.3  Meeting
502   7/1/2016 12:36   7/1/2016 13:00  ...   11.3  Meeting
503   7/1/2016 20:06   7/1/2016 20:24  ...   10.5  Meeting
504   7/1/2016 23:48    7/2/2016 0:09  ...    9.9  Meeting
..               ...              ...  ...    ...      ...
776  9/27/2016 21:01   9/28/2016 2:37  ...  195.6      NaN
777  9/28/2016 17:21  9/28/2016 19:36  ...   20.5      NaN
778  9/29/2016 16:13  9/29/2016 18:47  ...   12.6      NaN
779  9/30/2016 17:39  9/30/2016 20:20  ...   37.7      NaN
780  9/30/2016 20:59  9/30/2016 22:34  ...   16.7      NaN

[281 rows x 7 columns]

In [30]:
miles = df[(df['MILES*'] > 20) | (df['START_DATE*'] < str(9/30/2016))][['START_DATE*','MILES*']]
miles

           START_DATE*  MILES*
4       1/6/2016 14:42    63.7
25     1/14/2016 16:29    21.9
36     1/20/2016 13:25    40.2
62      2/1/2016 12:10    23.3
108     2/16/2016 3:21    43.7
...                ...     ...
979   11/20/2016 10:27    39.2
1088  12/21/2016 20:56   103.0
1089  12/22/2016 15:40    32.3
1092  12/22/2016 17:56    23.2
1154  12/31/2016 22:08    48.2

[83 rows x 2 columns]

## ISIN in pandas

In [7]:
#Find Out all rides to cary and morrisville
city = df[df['STOP*'].isin (['Cary','Morrisville'])]    
city

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
7,1/7/2016 13:27,1/7/2016 13:33,Business,Cary,Cary,0.8,Meeting
8,1/10/2016 8:05,1/10/2016 8:25,Business,Cary,Morrisville,8.3,Meeting
27,1/15/2016 0:41,1/15/2016 1:01,Business,Morrisville,Cary,8.0,Errand/Supplies
29,1/15/2016 13:26,1/15/2016 13:44,Business,Durham,Cary,10.4,Meal/Entertain
30,1/18/2016 14:55,1/18/2016 15:06,Business,Cary,Cary,4.8,Meal/Entertain
...,...,...,...,...,...,...,...
1050,12/14/2016 16:52,12/14/2016 17:10,Business,Cary,Cary,3.4,NaN
1051,12/14/2016 17:22,12/14/2016 17:34,Business,Cary,Cary,3.3,NaN
1052,12/14/2016 17:50,12/14/2016 18:00,Business,Cary,Morrisville,3.0,Meal/Entertain
1053,12/14/2016 20:24,12/14/2016 20:40,Business,Morrisville,Cary,3.1,Customer Visit
1054,12/15/2016 14:20,12/15/2016 14:54,Business,Cary,Morrisville,10.6,Meeting

### Assignment

In [23]:
# find all the data where distance is greater than 20 and starting point is Cary and New York
assignment = df.loc[(df['MILES*'] > 20) & (df['START*'].isin(['Cary','New York'])),['START_DATE*','END_DATE*','PURPOSE*']]

assignment

          START_DATE*         END_DATE*         PURPOSE*
268   3/25/2016 13:24   3/25/2016 16:22   Customer Visit
541   7/13/2016 12:39   7/13/2016 13:20              NaN
651   8/11/2016 18:37   8/11/2016 19:29              NaN
822  10/17/2016 15:19  10/17/2016 15:57              NaN
847   10/23/2016 9:24  10/23/2016 10:05              NaN
869  10/28/2016 15:53  10/28/2016 17:59          Meeting
979  11/20/2016 10:27  11/20/2016 11:32  Between Offices

In [29]:
assignment.reset_index(inplace = True,drop = True)
assignment

        START_DATE*         END_DATE*         PURPOSE*
0   3/25/2016 13:24   3/25/2016 16:22   Customer Visit
1   7/13/2016 12:39   7/13/2016 13:20              NaN
2   8/11/2016 18:37   8/11/2016 19:29              NaN
3  10/17/2016 15:19  10/17/2016 15:57              NaN
4   10/23/2016 9:24  10/23/2016 10:05              NaN
5  10/28/2016 15:53  10/28/2016 17:59          Meeting
6  11/20/2016 10:27  11/20/2016 11:32  Between Offices

### Sorting

In [35]:
new_data = df.sort_values(by=['MILES*'],ascending=False)
new_data

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN
546,7/14/2016 16:39,7/14/2016 20:05,Business,Morrisville,Banner Elk,195.3,NaN
...,...,...,...,...,...,...,...
945,11/12/2016 13:46,11/12/2016 13:50,Business,Central,West Berkeley,0.6,NaN
1121,12/27/2016 12:53,12/27/2016 12:57,Business,Kar?chi,Kar?chi,0.6,Meal/Entertain
420,6/8/2016 17:16,6/8/2016 17:18,Business,Soho,Tribeca,0.5,Errand/Supplies
44,1/26/2016 17:27,1/26/2016 17:29,Business,Cary,Cary,0.5,Errand/Supplies
120,2/17/2016 16:38,2/17/2016 16:43,Business,Katunayaka,Katunayaka,0.5,Errand/Supplies